[
    {
        "img": "../../pages/blog/list/pictures/zelda.jpg",
        "title": "The Quiet Strength of Zelda Ann Hintsa: A Struggle Veteran’s Reflection on Activism, Ubuntu, and Healing",
        "date":"October 02, 2024",
        "author":"Reem Ahmed",
        "introduction": "Zelda Ann Hintsa’s life is a tapestry woven with threads of resistance, pain, love, and resilience. Born on June 13, 1958, in the harsh reality of apartheid South Africa...",
        "url":"../../pages/blog/list/zelda.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/yaseen.jpeg",
        "title": "Unsung Hero of the Anti-Apartheid Struggle: The Legacy of Yaseen Mohamed",
        "date":"September 2, 2024",
        "author":"Zimasa Jaca",
        "introduction": "In the annals of South Africa’s storied struggle against apartheid, many iconic figures come to mind: Nelson Mandela, Walter Sisulu, and Desmond Tutu, to name a few. Yet, lurking in the shadows of...",
        "url":"../../pages/blog/list/yaseen.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/patricia.jpeg",
        "title": "Patricia Benjamin",
        "date":"August 13, 2024",
        "author":"Zimasa Jaca",
        "introduction": "Patricia Benjamin is a remarkable figure who played a key role during South Africa's liberation struggle. Her journey reflects the strength, resilience, and commitment of many individuals...",
        "url":"../../pages/blog/list/patricia.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/farid.jpeg",
        "title": "Growing Up Indian During Apartheid: Farid Sayed’s personal journey.",
        "date":"October 1, 2024",
        "author":"Zimasa Jaca",
        "introduction": "Farid Sayed's childhood was one shaped by the harsh realities of apartheid South Africa, a time when racial segregation was rigidly enforced, and the lives of those classified as 'coloured'...",
        "url":"../../pages/blog/list/farid.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/desmond.jpeg",
        "title": "Desmond Solomon “Solly” Gordon: The Forgotten Flame of Liberation",
        "date":"September 18, 2024",
        "author":"Zimasa Jaca",
        "introduction": "In the pages of South Africa’s history, countless names are immortalized in tales of the struggle against apartheid. Yet, some remain unsung forgotten by the public but not...",
        "url":"../../pages/blog/list/desmond.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/dehran.jpeg",
        "title": "Dehran Swart: A Fighter’s Journey from Apartheid’s Flames to Quiet Community Activism",
        "date":"July 27, 2024",
        "author":"Zimasa Jaca",
        "introduction": "South Africa’s fight against apartheid is often remembered through iconic figures, speeches, and triumphant moments. However, the true essence of the struggle lies in the countless untold...",
        "url":"../../pages/blog/list/dehran.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/charles.jpeg",
        "title": "Charles “Bubbles” Januarie: A Fighter, A Survivor, and A Voice for the Silenced",
        "date":"October 02, 2024",
        "author":"Zimasa Jaca",
        "introduction": "In the annals of South Africa’s history, it is often the quieter voices, the ones that fought in the streets and struggled in silence, that remain unheard. Among those voices was that...",
        "url":"../../pages/blog/list/charles.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/bonita.jpeg",
        "title": "Bonita Bennett: The Unsung Heroine of the Apartheid Struggle",
        "date":"September 9, 2024",
        "author":"Zimasa Jaca",
        "introduction": "In the shadows of South Africa’s history, where towering figures such as Nelson Mandela and Desmond Tutu are rightly celebrated, countless others contributed to the fight for liberation in ways...",
        "url":"../../pages/blog/list/bonita.txt"
    },
    {
        "img": "https://www.aamarchives.org/images/Images/apartheid/apd04.jpg",
        "title": "Asa Salie: A Mother’s Heart in the Fight for Freedom",
        "date":"August 12, 2024",
        "author":"Zimasa Jaca",
        "introduction": "Amidst the grand and fiery battles of South Africa’s fight against apartheid, the spotlight has often missed the everyday warriors—those whose courage unfolded in small homes and in the quiet...",
        "url":"../../pages/blog/list/asa.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/richard.jpeg",
        "title": "A Journey Through Struggle: The most wanted by the Apartheid government",
        "date":"August 20, 2024",
        "author":"Mangqamzana Nkanyiso",
        "introduction": "The 14 years old boy,  born and grew in the dominant Coloured neighborhood of Bonteheuwel. Desmond Richard  Abrahams, born in 19th August 1970 at...",
        "url":"../../pages/blog/list/richard.txt"
    },
    {
        "img": "https://antiapartheidlegacy.org.uk/wp-content/uploads/2022/09/aperheid-sudafrica-institucionalizacion-historia-e1654611836571.jpeg",
        "title": "Geraldine: A touch on the apartheid struggle",
        "date":"September 3, 2024",
        "author":"Mangqamzana Nkanyiso",
        "introduction": "Geraldine Roberts, 1972 the Cape Town woman born during the time where most of South Africans mostly people of colour were overwhelmed with the struggles of the apartheid. Growing up in Wellington...",
        "url":"../../pages/blog/list/geraldine.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/julian.jpeg",
        "title": "The Journey of Julian Stubbs: From Cape Flats to Activism",
        "date":"September 4, 2024",
        "author":"Mangqamzana Nkanyiso & Zimasa Jaca",
        "introduction": "Julian Stubbs was born in 1968 in the Cape Flats, an area in South Africa marked by racial segregation under apartheid. Raised in the neighbourhood of Lansdowne, Stubbs lived through a...",
        "url":"../../pages/blog/list/julian.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/deaf.jpeg",
        "title": "Principal for the deaf and hearing learners call for an acceptance ",
        "date":"July 21, 2024",
        "author":"Mangqamzana Nkanyiso",
        "introduction": "Hearing people should realise that deaf are not dump they are deaf.” Oasis Montessori Academy, located in the community of Bridgetown, Cape Town. The school cater its fair...",
        "url":"../../pages/blog/list/deaf.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/fidel.jpeg",
        "title": "Apartheid : “Farm workers paid with alcohol”",
        "date":"September 15, 2024",
        "author":"Mangqamzana Nkanyiso",
        "introduction": "Fidel  revealed that the farm workers under the apartheid system  were rather paid with alcohol. Fidel Issel, the 46 years old husband  and father to 3 children...",
        "url":"../../pages/blog/list/fidel.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/issel.jpg",
        "title": "Mrs Issel: Cape Town grandmother looks back at her arrests during apartheid",
        "date":"August 15, 2024",
        "author":"Mangqamzana Nkanyiso",
        "introduction": "A Young girl growing up during the time when most South Africans were suppressed by the vile system of Apartheid. “My  father looked  everywhere and they couldn’t not give him a...",
        "url":"../../pages/blog/list/issel.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/fatima.jpeg",
        "title": "Fatima Pandy",
        "date":"September 15, 2024",
        "author":"Athule Zamatyala",
        "introduction": "Fatima Pandy's journey into activism began at a young age, a result of growing up in a family deeply involved in the fight against apartheid. Surrounded by politically active older...",
        "url":"../../pages/blog/list/fatima.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/thandi.jpg",
        "title": "Voice of Resilience",
        "date":"July 27, 2024",
        "author":"Athule Zamatyala",
        "introduction": "In the annals of history, the stories of female veterans often remain shrouded in silence, overshadowed by their male counterparts. Yet, these women the resilient figures of the apartheid struggle...",
        "url":"../../pages/blog/list/thandi.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/majiedie.jpeg",
        "title": "Majiedie Abrahams",
        "date":"July 21, 2024",
        "author":"Athule Zamatyala",
        "introduction": "Majiedie Abrahams, born and raised in Cape Town, South Africa, is one of many unsung heroes of the anti-apartheid struggle. His life has been shaped by the fight for freedom, justice, and equality in...",
        "url":"../../pages/blog/list/majiedie.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/mansoor.jpeg",
        "title": "The Life and Activism of Mansoor Jaffer",
        "date":"July 21, 2024",
        "author":"Athule Zamatyala",
        "introduction": "Mansoor Jaffer, born in Wynberg in 1959, is a prominent figure in South Africa's history of resistance against apartheid. Growing up in a politically charged environment with his...",
        "url":"../../pages/blog/list/mansoor.txt"
    },
    {
        "img": "https://images.theconversation.com/files/236346/original/file-20180914-177935-1h2tvx9.jpg?ixlib=rb-4.1.0&q=20&auto=format&w=320&fit=clip&dpr=2&usm=12&cs=strip",
        "title": "Mr. Hanief Tiesker",
        "date":"July 21, 2024",
        "author":"Athule Zamatyala",
        "introduction": "Mr. Hanief Tiesker stood out as a symbol of optimism and fortitude in the face of injustice and oppression during the dark days of apartheid in South Africa. Hanief grows up in an environment where racial...",
        "url":"../../pages/blog/list/hanief.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/shahid.jpg",
        "title": "THE VETERAN MR SHAHID KHAN",
        "date":"October 02, 2024",
        "author":"Athule Zamatyala",
        "introduction": "Shahid Khan's journey, like many others who stood up against the apartheid regime in South Africa, is a testament to resilience, courage, and the unwavering belief in justice. Born in...",
        "url":"../../pages/blog/list/shahid.txt"
    },
    {
        "img": "../../pages/blog/list/pictures/waheed.jpeg",
        "title": "Waheed Sookool",
        "date":"October 02, 2024",
        "author":"Athule Zamatyala",
        "introduction": "Waheed Sookol was born in Cape Town in 1968 and embodies the spirit of resilience and activism shaped by the struggles of apartheid South Africa. Now he a 56-year-old father of two, Sookool...",
        "url":"../../pages/blog/list/waheed.txt"
    }
]